# Procesamiento de datos
## Fes Aragon
### ICO
#### Kareli Alvarez Valle

In [2]:
import pandas as pd
import numpy as np

In [3]:
from datetime import datetime
df = pd.DataFrame({'nombres':('Juan Pérez',
                                 'María Sánchez'
                                 , 'Jorge Vargas',
                                 'Rodrigo Martínez'),
            'fechas':(datetime(1995,12,21), 
                      datetime(1989,1,13), 
                      datetime(1992,9,14), 
                      datetime(1993,7,8)),
            'saldo': (2500, 
                      5345, 
                      np.NaN, 
                      11323.2),
            'al_corriente':(True, 
                            True, 
                            False, 
                            True)})

df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

# Operador .iloc

#### data.iloc[filas , columnas]

recupera filas y columnas segun su pocision

In [5]:
print(type(df.iloc[0]))
df.iloc[0] #Primer fila

<class 'pandas.core.series.Series'>

nombres                  Juan Pérez
fechas          1995-12-21 00:00:00
saldo                        2500.0
al_corriente                   True
Name: 0, dtype: object

In [6]:
df.iloc[1] #2da fila

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [7]:
df.iloc[-1] #last fila

nombres            Rodrigo Martínez
fechas          1993-07-08 00:00:00
saldo                       11323.2
al_corriente                   True
Name: 3, dtype: object

In [8]:
df.iloc[:,0] #Primer colum

0          Juan Pérez
1       María Sánchez
2        Jorge Vargas
3    Rodrigo Martínez
Name: nombres, dtype: object

In [9]:
df.iloc[:,1] #2da colum

0   1995-12-21
1   1989-01-13
2   1992-09-14
3   1993-07-08
Name: fechas, dtype: datetime64[ns]

In [10]:
df.iloc[:,-1] #lAST colum

0     True
1     True
2    False
3     True
Name: al_corriente, dtype: bool

In [11]:
df.iloc[1:3] #rango de filas

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [12]:
df.iloc[:3:2] #rango de filas

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [13]:
df.iloc[:,1:3] #rango de column

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [14]:
df.iloc[[1,3,0]] #lista de filas

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True
0        Juan Pérez 1995-12-21   2500.0          True

In [15]:
df.iloc[:,[1,3,0]] #lista de  column

      fechas  al_corriente           nombres
0 1995-12-21          True        Juan Pérez
1 1989-01-13          True     María Sánchez
2 1992-09-14         False      Jorge Vargas
3 1993-07-08          True  Rodrigo Martínez

In [16]:
df.iloc[[1,3,0],[1,3,0]] #lista de fil y colum

      fechas  al_corriente           nombres
1 1989-01-13          True     María Sánchez
3 1993-07-08          True  Rodrigo Martínez
0 1995-12-21          True        Juan Pérez

In [17]:
df.iloc[1,[1,3,0]]

fechas          1989-01-13 00:00:00
al_corriente                   True
nombres               María Sánchez
Name: 1, dtype: object

In [18]:
df.iloc[1,:]

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [ ]:
df.iloc[1, "fechas"] #No trabaja con etiquetas

In [19]:
# .loc 
# ####
# df.iloc[:,[1,3,0]] #lista de  column

In [21]:
df.loc[1:3] # 3 -> es la etiqueta, un nombre

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [22]:
df.loc[:, 'saldo':'al_corriente'] #rango de columnas

     saldo  al_corriente
0   2500.0          True
1   5345.0          True
2      NaN         False
3  11323.2          True

In [23]:
df.loc[:, 'saldo':'fechas'] #rango de columnas

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [24]:
df.loc[:, 'fechas':'saldo']

      fechas    saldo
0 1995-12-21   2500.0
1 1989-01-13   5345.0
2 1992-09-14      NaN
3 1993-07-08  11323.2

In [26]:
df.loc[:, ['fechas','saldo','nombres']]

      fechas    saldo           nombres
0 1995-12-21   2500.0        Juan Pérez
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [27]:
df.loc[1, ['fechas','saldo','nombres']]

fechas     1989-01-13 00:00:00
saldo                   5345.0
nombres          María Sánchez
Name: 1, dtype: object

In [28]:
df.loc[1:3, ['fechas','saldo','nombres']]

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [29]:
df.loc[[1,2,3], ['fechas','saldo','nombres']]

      fechas    saldo           nombres
1 1989-01-13   5345.0     María Sánchez
2 1992-09-14      NaN      Jorge Vargas
3 1993-07-08  11323.2  Rodrigo Martínez

In [30]:
print(df.loc[0:3])
print("----------".center(60,'*'))
print(df.iloc[1:3])

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True
*************************----------*************************
         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [31]:
df_iloc = df.iloc[0:3]
df_iloc

         nombres     fechas   saldo  al_corriente
1  María Sánchez 1989-01-13  5345.0          True
2   Jorge Vargas 1992-09-14     NaN         False

In [34]:
print(df.loc[1])
print("-----".center(40,'*'))
print(df.iloc[1])

nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object
*****************-----******************
nombres               María Sánchez
fechas          1989-01-13 00:00:00
saldo                        5345.0
al_corriente                   True
Name: 1, dtype: object

In [36]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [37]:
df['saldo'] > 3000

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [39]:
df.loc[df['saldo'] > 3000 ]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [40]:
df.loc[df['saldo'] > 3000, ['nombres', 'saldo'] ]

            nombres    saldo
1     María Sánchez   5345.0
3  Rodrigo Martínez  11323.2

In [42]:
ss3 = df['saldo'] > 3000
print(type(ss3))
ss3

<class 'pandas.core.series.Series'>

0    False
1     True
2    False
3     True
Name: saldo, dtype: bool

In [43]:
df.loc[ss3]

            nombres     fechas    saldo  al_corriente
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [44]:
df.loc[~ss3] #EL negado, osea los que se excluyen

        nombres     fechas   saldo  al_corriente
0    Juan Pérez 1995-12-21  2500.0          True
2  Jorge Vargas 1992-09-14     NaN         False

In [45]:
df.loc[df['al_corriente']]

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [47]:
df.loc[~df['al_corriente']]

        nombres     fechas  saldo  al_corriente
2  Jorge Vargas 1992-09-14    NaN         False

In [48]:
df.loc[df['al_corriente'],'nombres':'saldo']

            nombres     fechas    saldo
0        Juan Pérez 1995-12-21   2500.0
1     María Sánchez 1989-01-13   5345.0
3  Rodrigo Martínez 1993-07-08  11323.2

# .isnull()
visualiza el numero de datos falytantes por columnas

In [49]:
df

            nombres     fechas    saldo  al_corriente
0        Juan Pérez 1995-12-21   2500.0          True
1     María Sánchez 1989-01-13   5345.0          True
2      Jorge Vargas 1992-09-14      NaN         False
3  Rodrigo Martínez 1993-07-08  11323.2          True

In [50]:
df.isnull()

   nombres  fechas  saldo  al_corriente
0    False   False  False         False
1    False   False  False         False
2    False   False   True         False
3    False   False  False         False

In [52]:
df.isnull().sum()

nombres         0
fechas          0
saldo           1
al_corriente    0
dtype: int64

In [53]:
df.isnull().sum().sum()

1

In [55]:
print(type(df.isnull().values))
df.isnull().values

<class 'numpy.ndarray'>

array([[False, False, False, False],
       [False, False, False, False],
       [False, False,  True, False],
       [False, False, False, False]])

In [57]:
df.isnull().values.any()

True

In [59]:
df[df.isnull().any(1)]

C:\Users\kireli\AppData\Local\Temp\ipykernel_8240\1040708776.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.any and Series.any will be keyword-only.
  df[df.isnull().any(1)]

        nombres     fechas  saldo  al_corriente
2  Jorge Vargas 1992-09-14    NaN         False